Pet Home

Η πρόταση αφορά την κατασκευή ενός σταθμού προστασίας και τροφοδοσίας μικρών ζώων. Ο σταθμός είναι στην ουσία ένα ξύλινο σπιτάκι το οποίο θα περιλαμβάνει:
- έναν αυτόματο τροφοδότη ξηράς τροφής
- αυτόματη τροφοδοσία νερού
- ανεμιστήρα και αντίσταση για τη ρύθμιση της θερμοκρασίας
- συρόμενη πόρτα 
- φωτεινές προειδοποιητικές ενδείξεις

Όταν πλησιάσει κοντά στην πόρτα του σταθμού το ζώο που θα φοράει στο κολάρο του συγκεκριμένη RFID ταυτότητα, θα ανοίγει η συρόμενη πόρτα και θα μπορεί να μπει στο σταθμό προστασίας. Με την χρήση RFID ταυτότητας η πόρτα θα ανοίγει μόνο για το συγκεκριμένο ζώο. Η πόρτα θα παραμένει ανοικτή όσο το ζώο βρίσκεται μέσα στο σταθμό, όπου θα μπορεί να φάει μία δόση ξηράς τροφής και να πιει νερό και θα ξανακλείνει όταν το ζώο βγει από τον σταθμό. 
Όταν η θερμοκρασία είναι  υψηλή, ή όταν η θερμοκρασία είναι κάτω από ένα συγκεκριμένο όριο, θα ενεργοποιείται  αντίστοιχα ανεμιστήρας με σκοπό τη μείωση της θερμοκρασίας ή μικρή αντίσταση για την αύξηση της  θερμοκρασίας σε ειδικό καλάθι όπου θα μπορεί να κάθεται το ζώο.
Όταν υπάρχει έλλειψη νερού θα ανάβει φωτεινή προειδοποιητική ένδειξη.

Ο σταθμός θα έχει επικλινή οροφή για την απορροή των νερών της βροχής, θα βρίσκεται σε κάποια απόσταση από το έδαφος για την προστασία από την υγρασία εδάφους, θα έχει ανοιγόμενη οροφή για την πιο εύκολη πρόσβαση στους τροφοδότες, θα είναι βαμένος για προστασία από την βροχή.  

Ο σταθμός θα μπορούσε να χρησιμοποιηθεί τόσο για μικρόσωμα οικόσιτα ζώα ή και για αδέσποτα. 
Θα παρουσιαστεί από τους μαθητές στο τμήμα περίθαλψης ζώων του Δήμου Σύρου Ερμούπολης ως λύση για την φροντίδα των αδέσποτων ζώων.

Επεκτάσεις:
Τα παρακάτω προτάσεις επέκτασης ΔΕΝ θα υλοποιηθούν σε αυτή τη φάση.

Η κατασκευή ως επεκτάσεις θα μπορούσε να 
 - έχει αυτόματη τροφοδοσία νερού συνδεμένη με δίκτυο παροχής νερού
 - να έχει ηλιακό συλλέκτη ενέργειας για την πλήρη αυτονομία του
 - να ειδοποιεί μέσω σύνδεσης wifi στην περίπτωση έλλειψης νερού ή τροφής
 - να συνδυαστεί με άλλες κατασκευές για την δημιουργία μιας "γειτονιάς" σταθμών, με κοινή παροχή νερού και ενέργειας 

Εξοπλισμός: 
- 1 Arduino Uno
- 1 RFID αναγνώστη καρτών 
- 1 RFID κάρτα
- 2 Servo motors, 1 για την πόρτα και 1 για τον τροφοδότη ξηράς τροφής
- 1 Breadboard
- 2 μπαταρίες 9volt μαζί με το κλιπ για τροφοδοσία του arduino και της αντίστασης θερμότητας
- 1 λάμπα φωτεινής ένδειξης
- 2 ανεμιστήρες από παλιούς υπολογιστές
- 2 πλαστικά μπουκαλάκια 
- Καλώδια σύνδεσης

Αισθητήρες :
- 1 θερμοκρασίας
- 1 υγρασίας
- 2 υπερήχων

Κατασκευή σταθμού:
- Ξύλο τύπου "Κόντρα πλακέ θαλλάσης" 
- Μερικές ξυλόβιδες
- Μπογιά






